## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # argocd_application.cinema will be created
+   resource "argocd_application" "cinema" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "cinema"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               path            = "charts/cinema"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "cinema"
                }
            }
        }
    }

  # argocd_application.cinema-keda will be created
+   resource "argocd_application" "cinema-keda" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "cinema-keda"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               chart           = "keda"
+               path            = "."
+               repo_url        = "https://kedacore.github.io/charts"
+               target_revision = "2.8.2"

+               helm {
+                   release_name = "keda"
                }
            }
        }
    }

  # argocd_application.cinema-robusta will be created
+   resource "argocd_application" "cinema-robusta" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "robusta"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               chart           = "robusta"
+               path            = "."
+               repo_url        = "https://robusta-charts.storage.googleapis.com"
+               target_revision = "0.10.6"

+               helm {
+                   release_name = "robusta"
+                   skip_crds    = true
+                   values       = <<-EOT
                        customPlaybooks:
-                         actions:
-                           resource_babysitter:
                              fields_to_monitor:
-                               replicas
                          triggers:
-                           on_replicaset_update: 
                              name_prefix: ""
                    EOT

+                   parameter {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                }
            }

+           sync_policy {
+               sync_options = [
+                   "replace=true",
                ]
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-bookings will be created
+   resource "argocd_application" "keda-scaledobject-cinema-bookings" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cinema-bookings"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-bookings"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-bookings"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-movies will be created
+   resource "argocd_application" "keda-scaledobject-cinema-movies" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cinema-movies"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-movies"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-movies"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-showtimes will be created
+   resource "argocd_application" "keda-scaledobject-cinema-showtimes" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cinema-showtimes"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-showtimes"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-showtimes"
                    }
                }
            }
        }
    }

  # argocd_application.keda-scaledobject-cinema-users will be created
+   resource "argocd_application" "keda-scaledobject-cinema-users" {
+       cascade = true
+       id      = (known after apply)
+       wait    = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "env" = "dev"
            }
+           name             = "keda-cinema-users"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           project                = "cinema"
+           revision_history_limit = 10

+           destination {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           source {
+               path            = "charts/keda"
+               repo_url        = "https://github.com/autotune/microservices-docker-go-mongodb-tf"
+               target_revision = "main"

+               helm {
+                   release_name = "keda-cron"

+                   parameter {
+                       name  = "keda.name"
+                       value = "cinema-users"
                    }
+                   parameter {
+                       name  = "keda.namespace"
+                       value = "cinema"
                    }
+                   parameter {
+                       name  = "keda.scaletargetname"
+                       value = "cinema-users"
                    }
                }
            }
        }
    }

  # argocd_cluster.gcp-cinema will be created
+   resource "argocd_cluster" "gcp-cinema" {
+       id     = (known after apply)
+       info   = (known after apply)
+       name   = "gcp-cinema"
+       server = (sensitive)

+       config {
+           bearer_token = (sensitive value)

+           tls_client_config {
+               ca_data = (sensitive)
            }
        }
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
